In [2]:
#import library
import pandas as pd
import numpy as np

In [14]:
#create dataframe from dict of series  
olympic_series_paricipation = pd.Series([205,204,202,201,210],index=[1996,2000,2004,2008,2012])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[1996,2000,2004,2008,2012])
df_olympic = pd.DataFrame({'No. of participating countries':olympic_series_paricipation,'Host City':olympic_series_country})

In [15]:
#display the contents
df_olympic

      No. of participating countries Host City
1996                             205    London
2000                             204   Beijing
2004                             202    Athens
2008                             201    Sydney
2012                             210   Atlanta

In [16]:
#view dataframe describe
df_olympic.describe

<bound method NDFrame.describe of       No. of participating countries Host City
1996                             205    London
2000                             204   Beijing
2004                             202    Athens
2008                             201    Sydney
2012                             210   Atlanta>

In [17]:
#view top 2 records
df_olympic.head(2)

      No. of participating countries Host City
1996                             205    London
2000                             204   Beijing

In [18]:
#view last 3 records
df_olympic.tail(3)

      No. of participating countries Host City
2004                             202    Athens
2008                             201    Sydney
2012                             210   Atlanta

In [19]:
#view index of dataset
df_olympic.index

Int64Index([1996, 2000, 2004, 2008, 2012], dtype='int64')

In [20]:
#view columns of dataset
df_olympic.columns

Index(['No. of participating countries', 'Host City'], dtype='object')

In [21]:
#select data for host city
df_olympic['Host City']

1996     London
2000    Beijing
2004     Athens
2008     Sydney
2012    Atlanta
Name: Host City, dtype: object

In [22]:
#select data for host city 'No. of participating countries'
df_olympic['No. of participating countries']

1996    205
2000    204
2004    202
2008    201
2012    210
Name: No. of participating countries, dtype: int64

In [23]:
#view shape
df_olympic.shape

(5, 2)

In [36]:
#access by label
df_olympic.loc[2012]

No. of participating countries        210
Host City                         Atlanta
Name: 2012, dtype: object

In [27]:
#indexing by position
df_olympic.iloc[0:2]

      No. of participating countries Host City
1996                             205    London
2000                             204   Beijing

In [31]:
#data selection by index value
df_olympic.iat[0,0]

205

In [38]:
#select data where No. of participating countries > 204
df_olympic[df_olympic['No. of participating countries']>204]

      No. of participating countries Host City
1996                             205    London
2012                             210   Atlanta

In [74]:
#student data frame with math data
#df_math = pd.DataFrame({'Name':['Rohit','Rajesh','Abhishek','Hitesh','Partha','Sumaram'],'id':['1','2','3','4','5','6']})
df_math = pd.DataFrame({'Name':['Rohit','Rajesh','Abhishek','Hitesh','Partha','Sunaram'],
                        'ID':[1,2,3,4,5,6]
                       })
df_math

       Name  ID
0     Rohit   1
1    Rajesh   2
2  Abhishek   3
3    Hitesh   4
4    Partha   5
5   Sunaram   6

In [75]:
#student data frame with math data
#df_sc = pd.DataFrame({'Name':['Ranjan','Kumar','HansDa'],'id':['1','7','6']})
df_sc = pd.DataFrame({'Name':['Rohit','Rajesh','Sunaram'],
                      'ID':[1,7,6]
                     })
df_sc

      Name  ID
0    Rohit   1
1   Rajesh   7
2  Sunaram   6

In [76]:
#merge dataframes
pd.merge(df_math,df_sc)

      Name  ID
0    Rohit   1
1  Sunaram   6

In [73]:
#merge dataframe on name
pd.merge(df_math,df_sc,on='ID')

    Name_x  ID   Name_y
0    Rohit   1    Rohit
1  Sunaram   6  Sunaram

In [79]:
#merge left join on ID and fill null with X
pd.merge(df_math,df_sc,on='ID',how='left').fillna('X')

     Name_x  ID   Name_y
0     Rohit   1    Rohit
1    Rajesh   2        X
2  Abhishek   3        X
3    Hitesh   4        X
4    Partha   5        X
5   Sunaram   6  Sunaram

In [84]:
#concat dataframes
pd.concat([df_math,df_sc],ignore_index='True')

       Name  ID
0     Rohit   1
1    Rajesh   2
2  Abhishek   3
3    Hitesh   4
4    Partha   5
5   Sunaram   6
6     Rohit   1
7    Rajesh   7
8   Sunaram   6

In [86]:
#student survey data
df_survey = pd.DataFrame({'Name':['Rohit','Rajesh','Abhishek','Hitesh','Rohit','Rajesh'],
                        'ID':[1,2,3,4,1,2]
                       })

In [87]:
#view data
df_survey

       Name  ID
0     Rohit   1
1    Rajesh   2
2  Abhishek   3
3    Hitesh   4
4     Rohit   1
5    Rajesh   2

In [88]:
#view duplicates
df_survey.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [89]:
#drop duplicates with name key
df_survey.drop_duplicates('Name')

       Name  ID
0     Rohit   1
1    Rajesh   2
2  Abhishek   3
3    Hitesh   4